# MassGBXMLExportOptions Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
MassGBXMLExportOptions Class
Members See Also
---
Options used when exporting a gbXML file from a mass model document.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class MassGBXMLExportOptions : IDisposable
```

Visual Basic
---
```text
Public Class MassGBXMLExportOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class MassGBXMLExportOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Analysis..::..MassGBXMLExportOptions
# See Also
MassGBXMLExportOptions Members
Autodesk.Revit.DB.Analysis Namespace